{
  "date": "2023-03-09T09:27:55.172Z",
  "title": " Sopa Tarasca (Pinto Bean Soup) with Jalapeño Corn Fritters",
  "description": "Let’s make Sopa Tarasca! It’s a creamy, silky Mexican-inspired soup made with pinto beans, warm chili spices, and whole tomatoes. And you NEED a big pile of the jalapeño corn fritters on top. Drooling over this one!",
  "body": "This soup is a hug in a bowl.\n\nIt’s got a tomato and pinto bean base, with warm chili spices, a creamy silky thickness – and once you add in that generous pile of crispy, sweet, spicy melt-in-your-mouth corn fritters on top, the whole thing is going to have you coming back for more. And more. And then, okay, more again because this one just keeps getting better.\n\nWill you make soup art on top with that Mexican crema, cilantro, and salty cotija cheese? We hope so.\n\n![Sopa Tarasca in a bowl with a spoon and jalapeno corn fritters on top of the soup. ](https://pinchofyum.com/wp-content/uploads/Sopa-Tarasca-1.jpg)\n\n## Origins Of Sopa Tarasca\n\nSopa Tarasca (“Tarascan soup”) originated in the Michoacán state of Mexico and was given the name in honor of the indigenous peoples of that area, the Purépechas or Tarascos. It is made with tomatoes, garlic, onion, and our favorite little friend, pinto beans! It is also made with fresh or dried chiles native to that region, which help give it its warm smoky flavor.\n\nWe were first introduced to the soup by [this video on YouTube](https://www.youtube.com/watch?v=3lBSJUVIMnU) from Pati Jinich. We made her beautiful recipe immediately and it was so very, very yummy! Pati used whole dried ancho chiles, which are often trickier to find at our local grocery store (although if you can find them, they are absolutely delicious to use!).\n\nWe made some ever-so-slight swaps based on availability and preference, like using ancho chili powder instead, cooking the onion rather than adding it raw, and tossing in some extra cumin, to come up with this cozy-as-all-get-out nod to a more traditional sopa tarasca.\n\n## Why It’s So Good\n\nThis soup has heat but not exactly spiciness (though there is ancho chili powder). It’s like, actual warmth but not just from soup temperature either, you know? It’s just warm. The sun peeking through the clouds, or sitting just the right distance from the fire pit, or a soft thick sweatshirt and a perfectly weighted blanket. That kind of warm. You’ll feel it and it’s so great.\n\nThe creamy thickness that the soup gets from the pureed pinto beans makes you feel like you really made something special for yourself, and listen, you did.\n\nThis is also a topping lovers da-ream.\n\n* A swoopy swirl of Mexican crema on top (sour cream would also be delightful)\n* A confetti of fresh cilantro\n* Sprinkle on some cotija cheese at the end and then sprinkle some more. Still holding the bag? Great, one more sprinkle it is.\n\nWhat else are you thinking? Avocado chunks? Green onion? Chips? YES, YOU GET IT. You toppings champ, you.\n\nOur hearts were *specifically* called to make and include some little crispy salty-sweet jalapeño corn fritters. Sure, it’s a lil’ extra step, and yes there is some frying involved, but we think we may have been put on this earth to eat these fritters and we take this job very seriously.\n\nThe other VERY FUN THING about this soup is that it is incredibly versatile. Not only as a toppings trough but you can get creative with the leftovers (speaking of which, the soup is \\*even better\\* the next day). Did we use it as a sorta simmer sauce for chicken tacos? Yes, we did. Would it make a fantastic enchilada sauce? We really think so, please report back!\n\n## How To Make Sopa Tarasca (Pinto Bean Soup)\n\nThis bowl of lovely is a pretty simple sauté/simmer/puree sitch, so here is how it goes:\n\n1. Get your onions and garlic going until soft and fragrant, then spice it up with the ancho chili powder and cumin.\n2. Add your tomatoes and simmer away baby!\n3. Blend that until smooth and return to pot.\n4. Add your pinto beans and some broth to the blender and buzz those up, too!\n5. Mix everything together and simmer\n6. Consider, AND THEN DEFINITELY GO FOR, making some jalapeño corn fritters to pop on top for serving."
}